package com.zhian.gateway.third.hk.platform.consts;

import java.util.Collections;
import java.util.List;

/**
 * 平台相关常量
 *
 * @author tongwenjin
 * @since 2024 -12-13
 */
public interface PlatformConstants {
    /**
     * 海康平台默认订阅的事件类型
     * 越界侦测 131585,
     * 区域入侵 131588,
     * 进入区域 131586,
     * 离开区域 131587,
     * 人员聚集 131593,
     * 温差报警 192518,
     * 温度报警 192517,
     * 火点检测 192515,
     * 烟火检测 192514,
     * 烟雾检测 92513,
     * 监控点离线 889196545,
     * 视频丢失 131329,
     * 视频遮挡 131329,
     * 移动侦测 131331,
     * 快速移动 131592,
     * 停车侦测 131591,
     * 人数异常 131664,
     * 岗位值守 131603,
     * 人脸抓拍相关事件 131614,1644175361,1644171265
     */
    String DEFAULT_SUB_EVENTS = "131585,131588,131586,131587,131593,192518,192517,192515,192514,192513,889196545," +
            "131329,131329,131331,131592,131591,131664,131603,131614,1644175361,1644171265";

    /**
     * 人脸相关事件
     */
    List<String> FACE_EVENTS = Collections.singletonList("131614,1644175361,1644171265");

    /**
     * 设备离线事件
     */
    String OFFLINE_EVENT = "889196545";
}
